# -*- coding: utf-8 -*-
'''
Задание 4.7

Преобразовать MAC-адрес mac в двоичную строку такого вида:
'101010101010101010111011101110111100110011001100'

Ограничение: Все задания надо выполнять используя только пройденные темы.

'''

mac = 'AAAA:BBBB:CCCC'
mac = mac.split(':')
binmac_0 = (bin(int(mac[0],16)))[2:]
binmac_1 = (bin(int(mac[1],16)))[2:]
binmac_2 = (bin(int(mac[2],16)))[2:]
binmac_0 = (bin(int(mac[0],16)))[2:]
binmac = binmac_0+ binmac_1+ binmac_2
print(binmac)
print('101010101010101010111011101110111100110011001100')
